IdeaRS.OpenModel.Result.FemElement
Provides information about FEM element

IdeaRS.OpenModel.Result.FemElement.#ctor
Constructor

IdeaRS.OpenModel.Result.FemElement.#ctor(System.Int32,System.Int32,System.Int32)
Constructor for triangular element 2d
node1:
node2:
node3:

IdeaRS.OpenModel.Result.FemElement.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)
Constructor for quadrilateral element 2D
node1:
node2:
node3:
node4:

IdeaRS.OpenModel.Result.FemElement.Type
Type of the finite element
1 - triangular element 2D
2 - quadrilateral element 2D

IdeaRS.OpenModel.Result.FemElement.Vertices
Get list of vertices of the fem element